* TM-Analyse auf Teile von Protokollen, die die Rechenzentren explizit erwähnen. Training der Modelle

Wir müssen zuerst die Dateien aus unserem Ordner 'Rechenzentren' sortieren, die die Rechenzentren explizit erwähnen. Wir schreiben einen ersten Code-Block, in dem wir einen Ordner 'Rechenzentren_Teile' herstellen, wo wir die relevanten Dateien aus dem Ordner 'Rechenzentren' speichern:

#+name: mata-data-2
#+begin_src shell :var romdata="/home/cpsoz/ROM-Data" :var rechpath="/home/cpsoz/ROM-Data/Rechenzentren" :results silent
     mkdir $romdata/Rechenzentren_Teile
     teile=`grep -rl '[Rr]echenzentr' $rechpath`
     echo "$teile" | while IFS= read -r line ; do cp $line $romdata/Rechenzentren_Teile/; done
#+end_src

Wir [[https://github.com/cp1972/mta-app/blob/main/automate.md][automatisieren]] MTA mit der folgenden 'mta-train.txt'-Datei, und wir stellen einen Ordner 'BERT-TM-Skripten' her, um unsere Dateien und Skripten für die TM Analyse in diesem Ordner zu speichern:

#+name: autotrain-01
#+begin_src shell :var user=nuser :var rech="/home/cpsoz/ROM-Data/Rechenzentren_Teile" :var stopw=stops :results silent
  mkdir $user/BERT-TM-Skripten
  touch $user/BERT-TM-Skripten/mta-train.txt
  echo $rech"/*" >> $user/BERT-TM-Skripten/mta-train.txt
  echo "y" >> $user/BERT-TM-Skripten/mta-train.txt
  echo $stopw"/de.txt" >> $user/BERT-TM-Skripten/mta-train.txt
  echo "5" >> $user/BERT-TM-Skripten/mta-train.txt
  echo "n" >> $user/BERT-TM-Skripten/mta-train.txt
  echo "de" >> $user/BERT-TM-Skripten/mta-train.txt
  echo "a" >> $user/BERT-TM-Skripten/mta-train.txt
  echo "1" >> $user/BERT-TM-Skripten/mta-train.txt
  echo "y" >> $user/BERT-TM-Skripten/mta-train.txt
  echo "15" >> $user/BERT-TM-Skripten/mta-train.txt
  echo "4" >> $user/BERT-TM-Skripten/mta-train.txt
  echo "n" >> $user/BERT-TM-Skripten/mta-train.txt
  echo "0" >> $user/BERT-TM-Skripten/mta-train.txt
#+end_src

Diese Datei trainiert MTA mit Modellen, die von 2 bis 15 Topics reichen. Wir führen MTA mit dieser Datei im folgenden Code-Block aus:

#+name: trainmta
#+begin_src shell :var user=nuser :var usermta="/home/cpsoz/ROM-Data/TM-Analyse/TM-Skripten" :results none
  cat $user/BERT-TM-Skripten/mta-train.txt | python3 $usermta/MTA.py
#+end_src

Aus den Ergebnissen von MTA nehmen wir aus der Datei 'Summary*.log' die relevanten Informationen zu den optimalen Zahlen der Topics je Kreuzvalidierungsmethode, die MTA verwendet. Wir übernehmen auch die Information zu der besten Anzahl der Topics nach Cophenet Korrelationskoeffizient. Wir speichern diese Informationen in einer Datei 'TM-train-scores.txt'.

#+name: trainscores
#+begin_src shell :var mtadir="/home/cpsoz/Github/rom/Methodologie" :var user=nuser :results silent
  echo " " >> $user/BERT-TM-train-scores.txt
  cat $mtadir/MTA-Results*/Summary*.log | sed -n '/Elbow /,/Correlation values LDA/p' | awk 'NF' | awk '{$1=$1;print}' >> $user/BERT-TM-train-scores.txt
  echo "------" >> $user/BERT-TM-train-scores.txt
  echo " " >> $user/BERT-TM-train-scores.txt
  find $mtadir -type d -name "MTA-Results*" -exec rm -r {} +
#+end_src

Wir können dann die Ergebnisse aus der Datei 'TM-train-scores.txt' mit dem folgenden Code-Block lesen.

#+name: mta-scores
#+begin_src shell :var user=nuser :results drawer
    cat $user/BERT-TM-train-scores.txt
#+end_src

#+RESULTS: mta-scores
:results:

Elbow | No optimal topic
Silhouette | Optimal topics, better to worst: 6 8 10 11 12 13 14
Calinski Harabasz | Optimal topics, better to worst: 13 14
Davies Bouldin | Optimal topics, better to worst: 3 4 5 6 8 10 11 12 13 14
NMF-Cophenet | Optimal topics, better to worst: 3 5 6 7 10 12 13
Correlation values NMF-Cophenet: (0.7172416876046004, 0.6107818751672857, 0.6411485869549876, 0.6314090328283718, 0.7760202232221576, 0.7284745654214617, 0.763058470800228)
LDA-Cophenet | Optimal topics, better to worst: 3 8 11 13
Correlation values LDA-Cophenet: (0.6291944961666273, 0.8664864589342771, 0.7144070029386059, 0.9145840305388004)
------

:end:

Wir können jetzt die Dateien mit dem optimalen Anzahl an Topics modellieren.

